tap "aws/tap"
tap "azure/functions"
tap "ddev/ddev"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
brew "apktool"
brew "aws-sam-cli"
brew "awscli"
brew "cocoapods"
brew "coreutils"
brew "docker-compose"
brew "gnupg"
brew "jq"
brew "lima"
brew "mas"
brew "nvm"
brew "pkgconf"
brew "qemu"
brew "sdl2"
brew "wget"
brew "azure/functions/azure-functions-core-tools@4"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "amazon-q"
cask "android-studio"
cask "aws-vpn-client"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "dbngin" # Database versioning tool
cask "datagrip"
cask "dataspell"
cask "docker"
cask "firefox"
cask "jordanbaird-ice" # Manage menu bar icons
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "kindle"
cask "legcord" # Lightweight Discord client (Messaging / Community)
cask "marta" # File manager
cask "notion"
cask "notion-calendar"
cask "orbstack" # Running containerized applications. Ships `docker-compose` as well
cask "phpstorm"
cask "pycharm"
cask "postman"
cask "raycast"
cask "rocket" # Handy emojis picker
cask "syntax-highlight", args: { no_quarantine: true } # Preview many different source code files
cask "slack"
cask "spotify"
brew "starship" # Prompt manager
cask "tableplus" # Database managmenent system
#cask "temurin@11"
cask "visual-studio-code"
cask "warp"
cask "windsurf"
cask "vivaldi", args: { no_quarantine: true } # Browser with built-in privacy
cask "whatsapp"

vscode "1password.op-vscode"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "atlassian.atlascode"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "chakrounanas.turbo-console-log"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fivethree.vscode-ionic-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ilich8086.untabify"
vscode "ionic.ionic"
vscode "jheilingbrunner.vscode-gnupg-tool"
vscode "leizongmin.node-module-intellisense"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscode-dotnet-sdk"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sonarsource.sonarlint-vscode"
vscode "swordev.phpstan"
vscode "vncz.vscode-apielements"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296
mas "Email", id: 1489591003
mas "Perplexity", id: 6714467650
mas "bear-markdown-notes", id:id1091189122
mas "CotEditor", id: 1024640650